Revit 2027 API
TemporaryGraphicsCommandData.Index Property
 The unique index of the temporary graphics object managed by TemporaryGraphicsManager.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
public:
property int Index {
	int get ();
}
member Index : int with get
Property Value
Int32
See Also
Reference
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace